erp3l/src/Catalogs/ПланыСчетовМеждународногоУчета/ПланыСчетовМеждународногоУчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПланыСчетовМеждународногоУчета</name>
  <predefined>
    <items>
      <name>Международный</name>
    </items>
  </predefined>
  <attributes>
    <name>УчетВФункциональнойВалюте</name>
    <type>
      <types>EnumRef.ВидыУчетаВФункциональнойВалюте</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаПредставления</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВалютаФункциональная</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
</mdclass:Catalog>

erp3l/src/Catalogs/ПланыСчетовМеждународногоУчета/Forms/ФормаНастройкиВалют/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	Элементы.УчетВФункциональнойВалюте.СписокВыбора.Очистить();
	
	ПредставлениеЗначения = СтрШаблон(
		НСтр("ru = 'в валюте регламентированного учета организаций';
			|en = 'in companies'' local accounting currency'"));
	Элементы.УчетВФункциональнойВалюте.СписокВыбора.Добавить(
		Перечисления.ВидыУчетаВФункциональнойВалюте.ВВалютеРегл, ПредставлениеЗначения);
	
	ПредставлениеЗначения = СтрШаблон(
		НСтр("ru = 'в валюте управленческого учета';
			|en = 'in management accounting currency'"));
	Элементы.УчетВФункциональнойВалюте.СписокВыбора.Добавить(
		Перечисления.ВидыУчетаВФункциональнойВалюте.ВВалютеУпр, ПредставлениеЗначения);
		
	МеждународныйПланСчетов = Справочники.ПланыСчетовМеждународногоУчета.Международный.ПолучитьОбъект(); 
		
	ЗаполнитьЗначенияСвойств(ЭтаФорма, МеждународныйПланСчетов);
	
	// Обработчик подсистемы запрета редактирования реквизитов объектов
	ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект,,,
		МеждународныйПланСчетов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Модифицированность И НЕ ЗавершениеРаботы Тогда
		Отказ = Истина;
		ОбработчикОтвета = Новый ОписаниеОповещения("ЗавершениеЗакрытияФормы", ЭтотОбъект);
		ПоказатьВопрос(ОбработчикОтвета, НСтр("ru = 'Данные были изменены. Сохранить изменения?';
												|en = 'The data has changed. Do you want to save the changes?'"), РежимДиалогаВопрос.ДаНетОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеЗакрытияФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		СохранитьДанные();
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьЗакрыть(Команда)
	
	Если Модифицированность Тогда
		СохранитьДанные();
		Модифицированность = Ложь;
	КонецЕсли;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти



#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	
	ОткрытьФорму("Справочник.ПланыСчетовМеждународногоУчета.Форма.РазблокированиеРеквизитов",,,,,,
		Новый ОписаниеОповещения("Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение", ЭтотОбъект),
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъектаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") И Результат.Количество() > 0 Тогда
		ЗапретРедактированияРеквизитовОбъектовКлиент.УстановитьДоступностьЭлементовФормы(ЭтаФорма, Результат);
	КонецЕсли;
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьДанные()
	
	ПланСчетов = Справочники .ПланыСчетовМеждународногоУчета.Международный.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(ПланСчетов, ЭтаФорма, , "ЭтотОбъект");
	ПланСчетов.Записать();
	
КонецПроцедуры

#КонецОбласти
